{
    "id": {
        "0": 1,
        "1": 2,
        "2": 3,
        "3": 4,
        "4": 5,
        "5": 6,
        "6": 7,
        "7": 8,
        "8": 9,
        "9": 10,
        "10": 11,
        "11": 12,
        "12": 13,
        "13": 14,
        "14": 15,
        "15": 16,
        "16": 17,
        "17": 18,
        "18": 19,
        "19": 20
    },
    "head": {
        "0": "5 things to know before the stock market opens Wednesday - CNBC",
        "1": "Overtime selects Atlanta for its basketball league that pays 16-to-18-year-olds $100,000 - CNBC",
        "2": "Bitcoin plunges to $40,000 as China widens its crypto crackdown - CNN ",
        "3": "New OCC head requests review of cryptocurrency rules - Cointelegraph",
        "4": "3 ways Social Security can save your retirement when you haven't saved enough - Fox Business",
        "5": "Lowe's earnings beat on robust home improvement spending, but shares fall - CNBC",
        "6": "Burger King to enter chicken sandwich wars with the Ch'King - CNBC",
        "7": "Target sales jump 23% as exclusive brands, curbside pickup draw in shoppers - CNBC",
        "8": "Crypto carnage—Bitcoin, Ethereum, Dogecoin all bomb lower - Fortune",
        "9": "JetBlue Reveals London Schedule As Tickets Briefly Go On Sale - Simple Flying",
        "10": "European Central Bank warns of insolvencies when pandemic stimulus measures are lifted - CNBC",
        "11": "A driver appeared to be sleeping behind the wheel of an autonomous Tesla, authorities say. So deputies pulled him over - CNN ",
        "12": "MORNING BID-Inflation woes linger, bitcoin tumbles (again) - Yahoo Finance",
        "13": "FOREX-Dollar holds fast before Fed, bitcoin crumbles on China risk - Reuters",
        "14": "European markets fall, following global stocks lower - CNBC",
        "15": "U.S. postpones ban on trading Chinese stocks with alleged military ties - CNBC",
        "16": "Why Moody’s Raised Global Airline Outlook to 'Positive' - Yahoo Finance",
        "17": "Gas prices climb amid Biden's pipeline closures - Fox Business",
        "18": "‘Flamin’ Hot’ Screenwriter Defends Cheetos Movie: ‘Enough of the Story Is True’ - Variety",
        "19": "China warns again on cryptocurrency risks amid ‘wild fluctuations’ - South China Morning Post"
    },
    "source": {
        "0": "CNBC",
        "1": "CNBC",
        "2": "CNN",
        "3": "Cointelegraph",
        "4": "Motley Fool",
        "5": "CNBC",
        "6": "CNBC",
        "7": "CNBC",
        "8": "Fortune",
        "9": "Simple Flying",
        "10": "CNBC",
        "11": "CNN",
        "12": "Yahoo Entertainment",
        "13": "Reuters",
        "14": "CNBC",
        "15": "CNBC",
        "16": "Yahoo Entertainment",
        "17": "Fox Business",
        "18": "Variety",
        "19": "Post Magazine"
    },
    "content": {
        "0": "2. Bitcoin falls below $40,000 for first time in 14 weeks; Tesla falls\n\nBitcoin on Wednesday plunged below $40,000 for the first time in 14 weeks. In fact, the world's biggest cryptocurrency hit a morning low of below $35,000 per unit, an over 46% decline from last month's all-time high near $65,000",
        "1": "Media company Overtime has selected Atlanta to host its basketball league that will pay teen players over $100,000 a season. The company is also constructing a new building for the games.\n\nOvertime Elite, which will exclusively feature high-school-level players between the ages of 16 and 18, release",
        "2": "Hong Kong (CNN Business) Bitcoin and other cryptocurrencies are plunging as anxiety spreads through the market — this time, after China took more steps to crack down on the digital coins.\n\nThe world's most heavily traded cryptocurrency plunged as low as $30,202 per coin from a high of nearly $44,000",
        "3": "This process is automatic. Your browser will redirect to your requested content shortly.\n\nPlease allow up to 5 seconds…",
        "4": "There's no single retirement savings number that guarantees you'll have enough money to pay all of your bills. But as a general rule, it's a good idea to retire having banked 10 times your ending career salary. Now there's wiggle room with that number, such as if you plan to downgrade your lifestyle",
        "5": "Lowe's said Wednesday that fiscal first-quarter sales rose 24%, outpacing Wall Street expectations, as consumers continued to invest in their homes and sales picked up among home professionals. The home improvement retailer said momentum continued into May. Based on these trends, Lowe's said it's tr",
        "6": "Burger King will enter the chicken sandwich wars in June with the Ch'King, its take on the trendy menu item.\n\nThe Restaurant Brands International chain is following in the footsteps of sister chain Popeyes, which launched its own blockbuster sandwich in August 2019. For 1½ years, the fried chicken c",
        "7": "Target said Wednesday fiscal first-quarter sales rose 23%, as investments it made in exclusive brands and services like curbside pickup strengthened customer loyalty and kept them coming back.\n\nThe retailer also said it is benefiting from rising vaccination rates, a reopening economy and busier soci",
        "8": "A vastly improved search engine helps you find the latest on companies, business leaders, and news more easily.",
        "9": "It seems that JetBlue has confirmed that it will be flying to London Heathrow Airport when it launches transatlantic flights later this year. While the JetBlue booking engine was down at the time of writing, Twitter user Ashley Quint spotted the fares on sale earlier this morning.\n\nFor months we’ve ",
        "10": "LONDON — The 19 nations that share the euro are facing financial risks that are elevated and uneven, the European Central Bank warned Wednesday, and more targeted stimulus could be required as the region recovers from the coronavirus crisis. The pandemic has hit different economic sectors with varyi",
        "11": "When one deputy pulled alongside the vehicle near the Wisconsin and Illinois border, he saw \"that the driver's head was down and was not looking at the road,\" the release said. The deputy followed the Tesla for about two miles with the squad car's lights and sirens activated before the driver realiz",
        "12": "A look at the day ahead from Saikat Chatterjee.\n\nGlobal stocks are nursing losses after a selloff in U.S. cyclical stocks spread to the wider market with benchmark indexes closing nearly 1% down as inflation concerns continued to dominate investors minds.\n\nThose concerns bubbled up in Bank of Americ",
        "13": "",
        "14": "The pan-European Stoxx 600 slid 1.6% by afternoon deals, with basic resources dropping 3.4% to lead losses as all sectors and major bourses traded firmly in negative territory. European markets are following dour sentiment elsewhere; U.S. stock futures were lower in early premarket trading on Wednes",
        "15": "BEIJING — The U.S. Treasury said Tuesday it was postponing a ban on trading shares of companies with alleged links to the Chinese military.\n\nThe new restrictions take effect June 11, versus the prior date of May 27.\n\nThe move by U.S. President Joe Biden's administration extends a grace period for in",
        "16": "May.18 -- Jonathan Root, senior vice president of Moody’s Investors Service, explains why the ratings agency has raised its outlook for global airlines by two notches to positive from negative, He speaks with Rishaad Salamt and Haslinda Amin on \"Bloomberg Markets: Asia.\"",
        "17": "It could be a summer of pain at the nation's gas stations due to surging fuel demand and the threat of potential pipeline shutdowns.\n\nGas prices are still climbing to decade-level highs jumping nearly 20% on Monday and registering pandemic-level highs according to new data from GasBuddy.\n\nThe nation",
        "18": "The screenwriter of an upcoming film about Flamin’ Hot Cheetos defended the project on Tuesday, after a Los Angeles Times report challenged the central character’s claim to have invented the snack product.\n\nLewis Colick argued that Richard Montañez, the hero of “Flamin’ Hot,” still has an inspiring ",
        "19": "Bitcoin was trading at around US$43,860 late on Tuesday, compared with US$55,000 a week earlier. Photo: Handout"
    },
    "link": {
        "0": "https://www.cnbc.com/2021/05/19/5-things-to-know-before-the-stock-market-opens-wednesday-may-19.html",
        "1": "https://www.cnbc.com/2021/05/19/overtime-selects-atlanta-for-teen-basketball-league-that-pays-100000.html",
        "2": "https://www.cnn.com/2021/05/19/investing/bitcoin-price-drop-china-crypto-intl-hnk/index.html",
        "3": "https://cointelegraph.com/news/new-occ-head-requests-review-of-cryptocurrency-rules",
        "4": "https://www.fool.com/retirement/2021/05/19/3-ways-social-security-can-save-your-retirement-wh/",
        "5": "https://www.cnbc.com/2021/05/19/lowes-low-earnings-q1-2021.html",
        "6": "https://www.cnbc.com/2021/05/19/burger-king-to-enter-chicken-sandwich-wars-with-the-chking.html",
        "7": "https://www.cnbc.com/2021/05/19/target-tgt-q1-2021-earnings.html",
        "8": "https://fortune.com/2021/05/19/crypto-carnage-bitcoin-ethereum-dogecoin-selloff/",
        "9": "https://simpleflying.com/jetblue-london-ticket-sales/",
        "10": "https://www.cnbc.com/2021/05/19/ecb-financial-stability-report-may-2021.html",
        "11": "https://www.cnn.com/2021/05/19/us/illinois-man-sleeping-tesla-trnd/index.html",
        "12": "https://finance.yahoo.com/news/morning-bid-inflation-woes-linger-064705322.html",
        "13": "https://www.reuters.com/article/global-forex-idUSL3N2N615H",
        "14": "https://www.cnbc.com/2021/05/19/european-markets-set-to-plunge-at-open-following-global-stocks-lower.html",
        "15": "https://www.cnbc.com/2021/05/19/us-postpones-ban-on-trading-chinese-stocks-with-alleged-military-ties.html",
        "16": "https://finance.yahoo.com/video/why-moody-raised-global-airline-031941382.html",
        "17": "https://www.foxbusiness.com/economy/gas-biden-pipeline-energy-closure-how-high-will-prices-go",
        "18": "https://variety.com/2021/film/news/flamin-hot-cheetos-richard-montanez-screenwriter-1234976147/",
        "19": "https://www.scmp.com/tech/policy/article/3133967/beijing-sends-another-warning-cryptocurrency-risks-amid-recent-elon"
    }
}